/* 防止重复包含 --------------------------------------------------------------*/
#ifndef __INCLUDES_H
#define __INCLUDES_H

/* 包含头文件 ----------------------------------------------------------------*/
#include "stm32f10x.h"
#include "system_stm32f10x.h"
#include "stm32f10x_conf.h"
#include "stm32f10x_it.h"
#include "usart_send.h"
#include "RPLIDAR_parse.h"

/* 变量声明 ------------------------------------------------------------------*/

/* 函数声明 ------------------------------------------------------------------*/
#endif