/* 包含头文件 ----------------------------------------------------------------*/
#include "includes.h"
/* 变量定义 ------------------------------------------------------------------*/

/* 函数定义 ------------------------------------------------------------------*/
//----------------------------------------------------------------------------//
//函数功能：不可屏蔽中断函数
//入口参数：无
//出口参数：无
//最后修改：2016.4.18
//备注：
//----------------------------------------------------------------------------//
void NMI_Handler(void)
{
}

//----------------------------------------------------------------------------//
//函数功能：硬Fault中断函数
//入口参数：无
//出口参数：无
//最后修改：2016.4.18
//备注：
//----------------------------------------------------------------------------//
void HardFault_Handler(void)
{
	while (1)
	{
	}
}

//----------------------------------------------------------------------------//
//函数功能：Memory Management中断函数
//入口参数：无
//出口参数：无
//最后修改：2016.4.18
//备注：
//----------------------------------------------------------------------------//
void MemManage_Handler(void)
{
	while (1)
	{
	}
}

//----------------------------------------------------------------------------//
//函数功能：总线Fault中断函数
//入口参数：无
//出口参数：无
//最后修改：2016.4.18
//备注：
//----------------------------------------------------------------------------//
void BusFault_Handler(void)
{
	while (1)
	{
	}
}

//----------------------------------------------------------------------------//
//函数功能：用法Fault中断函数
//入口参数：无
//出口参数：无
//最后修改：2016.4.18
//备注：
//----------------------------------------------------------------------------//
void UsageFault_Handler(void)
{
	while (1)
	{
	}
}

//----------------------------------------------------------------------------//
//函数功能：SV Call中断函数
//入口参数：无
//出口参数：无
//最后修改：2016.4.18
//备注：
//----------------------------------------------------------------------------//
void SVC_Handler(void)
{
}

//----------------------------------------------------------------------------//
//函数功能：Debug Monitor中断函数
//入口参数：无
//出口参数：无
//最后修改：2016.4.18
//备注：
//----------------------------------------------------------------------------//
void DebugMon_Handler(void)
{
}

//----------------------------------------------------------------------------//
//函数功能：Pend SV中断函数
//入口参数：无
//出口参数：无
//最后修改：2016.4.18
//备注：
//----------------------------------------------------------------------------//
void PendSV_Handler(void)
{
}
//----------------------------------------------------------------------------//
//函数功能：USART1中断函数 接收雷达数据
//入口参数：无
//出口参数：无
//最后修改：2017.2.3
//备注：
//----------------------------------------------------------------------------//
void USART1_IRQHandler(void)
{ 
	GPIOC->ODR ^= GPIO_ODR_ODR13;//Flip the LED
	if (USART_GetFlagStatus(USART1, USART_IT_RXNE) == SET)
	{      		
		USART_ClearFlag(USART1, USART_IT_RXNE);//clear the receive flag
		if (lidarCheckRightFlag == RESET)
		{
			lidarCheckTable[0] = lidarCheckTable[1];
			lidarCheckTable[1] = USART_ReceiveData(USART1);
			u8 check0 = (lidarCheckTable[0] & 0x1) + ((lidarCheckTable[0] & 0x2) >> 1);
			u8 check1 = lidarCheckTable[1] & 0x1;
			if (check0 == 0x1 && check1 == 0x1)
			{
				lidarCheckRightFlag = SET;//First byte check successful
				lidarCheckTable[0] = 0;
				return;
			}
		}
		else//SET
		{
			if (lidarDataCnt == 0)
			{
				lidarDataTable[0] = lidarCheckTable[1];
				lidarDataCnt++;
			}
			lidarDataTable[lidarDataCnt++] = USART_ReceiveData(USART1);
			if (lidarDataCnt >= 4)//正确数据接收完成，开始解析数据 A frame of data reception is complete
			{
				lidarDataCnt = 0;
				lidarCheckRightFlag = RESET;
				for (u8 i = 0; i < 4; i++)
					lidarOriginalData[i] = lidarDataTable[i];//转移数据到main函数 Transfer data to main
				lidarStartParseFlag = SET;				
			}
		}
	}
}

//----------------------------------------------------------------------------//
//函数功能：TIM2中断函数
//入口参数：无
//出口参数：无
//最后修改：2017.2.3
//备注：
//----------------------------------------------------------------------------//
void TIM2_IRQHandler(void)
{
	
}
  
/************************************************************  
 * Function: SysTick_Handler  
 * Description: 滴答定时器中断，1ms  
 * Input parameter: void  
 * Return parameter: void  
 * Calls:  
 * Called by:  
 * Author: zilin Wang     Build_Date：2017/4/16 星期日    
 * Other:  
*************************************************************/  
   
void SysTick_Handler(void)  
{  
	if (systickCnt < 100)
		systickCnt++;
}  

